---
kind: property
id: P:Autodesk.Revit.DB.Electrical.WireType.NeutralRequired
source: html/8b4f997f-4fbd-c2f3-8e49-d5d3d7e53afd.htm
---
# Autodesk.Revit.DB.Electrical.WireType.NeutralRequired Property

Whether or not the neutral point is required.

## Syntax (C#)
```csharp
public bool NeutralRequired { get; set; }
```